# ZoneCalculatedAreaPerHeatingLoadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneCalculatedAreaPerHeatingLoadParam Property
ParameterTypeId Class See Also
---
"Calculated Area per Heating Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneCalculatedAreaPerHeatingLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneCalculatedAreaPerHeatingLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneCalculatedAreaPerHeatingLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace